<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest build of Azul JDK for the specified achitecture and version</string>
    <key>Identifier</key>
    <string>com.github.itrc-canada.download.azuljava</string>
    <key>Input</key>
    <dict>
        <key>BASE_VERSION</key>
        <string>0</string>
        <key>ARCHITECTURE</key>
        <string />
        <key>ENVIRONMENT</key>
        <string />
        <key>NAME</key>
        <string>AzulJDK Unspecified</string>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AzulURLProvider</string>
            <key>Arguments</key>
            <dict>
                <key>base_version</key>
                <string>%BASE_VERSION%</string>
                <key>arch</key>
                <string>%ARCHITECTURE%</string>
                <key>environment</key>
                <string>%ENVIRONMENT%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%download_url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%/*.pkg</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/azuljdk%download_version%.%ARCHITECTURE%.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pkg_path%</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: Azul Systems, Inc. (TDTHCUPYFR)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
            </dict>
        </dict>
    </array>
</dict>
</plist>