<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads/Packages the latest arm64 build of Visual Studio Code and imports to Munki</string>
    <key>Identifier</key>
    <string>com.github.itrc-canada.munki.arm64.vscode</string>
    <key>Input</key>
    <dict>
        <key>ARCHITECTURE</key>
        <string>arm64</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/microsoft/visualstudiocode/%ARCHITECTURE%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Visual Studio Code is a code editor redefined and optimized for building and debugging modern web and cloud applications.</string>
            <key>developer</key>
            <string>Microsoft</string>
            <key>display_name</key>
            <string>Visual Studio Code</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true />
            <key>supported_architectures</key>
            <array>
                <string>%ARCHITECTURE%</string>
            </array>
            <key>blocking_applications</key>
            <array>
                <string>Visual Studio Code.app</string>
            </array>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>2.3</string>
    <key>ParentRecipe</key>
    <string>com.github.itrc-canada.dmg.arm64.vscode</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>